电脑/linux/git/git知识补充.org
cdwanze #+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS:[11pt,oneside]
#+LATEX_HEADER: \usepackage{article}


#+TITLE: git知识补充
#+AUTHOR: 万泽(德山书生)
#+CREATOR: wanze(<a href="mailto:a358003542@gmail.com">a358003542@gmail.com</a>)
#+DESCRIPTION: 制作者邮箱：a358003542@gmail.com


* 输入 ~git status~ 中文路径名是乱码
请读者参看 [[https://gist.github.com/nightire/5069597][这个网页]] 。

具体在ubuntu下终端的显示，我试了一下只需要如下设置即可:
#+BEGIN_EXAMPLE
git config --global core.quotepath false
#+END_EXAMPLE

简单来说就是git的路径默认转义行为关闭了。官方完整文档解释如下:

#+BEGIN_QUOTE
core.quotePath
The commands that output paths (e.g. ls-files, diff), when not given the -z option, will quote "unusual" characters in the pathname by enclosing the pathname in a double-quote pair and with backslashes the same way strings in C source code are quoted. If this variable is set to false, the bytes higher than 0x80 are not quoted but output as verbatim. Note that double quote, backslash and control characters are always quoted without -z regardless of the setting of this variable.
#+END_QUOTE




* github走ssh通道
github走ssh通道。之前我都不在意，都是勤快的手工输入密码的。。github那边把你的ssh密钥加进去，然后你的项目 ~.git/config~ 那个文件的 url 设置为git连接即可，

首先测试一下连通性吧:

#+BEGIN_EXAMPLE
bash>>> ssh git@github.com﻿
#+END_EXAMPLE
